{"reviewerID": "A2ONKVCEKZSAE9", "asin": "B000052YOL", "reviewerName": "Pink Domo", "helpful": [0, 0], "reviewText": "Great product, not greasy at all. I would recommend it! This product was in Allure magazine, and all those girly magazines, which is why I decided to try it out. Great stuff, been using it for years. Never caused me to break out or anything.", "overall": 5.0, "summary": "Great for my skin", "unixReviewTime": 1376352000, "reviewTime": "08 13, 2013"}
{"reviewerID": "A1DR7C1WWOXR0G", "asin": "B000052YOL", "reviewerName": "Pinkmimosa", "helpful": [9, 12], "reviewText": "My Dermatologist told me to start using this when I was 25 since i had a bad scaly patch and just could never ever get a grip on my dry skin. I have super dry skin and had been trying all kinds of stuff, even vasoline and olive oil. My skin is so dry it hurts after I take a shower. Anyway I've used this, and only this plus the other night one in the pump - and my skin looks awesome and I'm almost 40 now. I stopped when I was pregnant, and when I had the baby as these creams may not be good for pregnant ladies or infants (they don't know but it's a lot of vitamin A so play it safe). I just used coconut oil (straight) during those times. EVERYONE has always told me they CANNOT believe my age, I look way way young for my age. I can show you a photo if you want.", "overall": 5.0, "summary": "Been using for fifteen years now - look great", "unixReviewTime": 1352764800, "reviewTime": "11 13, 2012"}
{"reviewerID": "AYL7UJ18Q92JW", "asin": "B000052YOL", "reviewerName": "Puddlejumper8", "helpful": [0, 0], "reviewText": "All the neutrogena are very effective when it comes to anti wrinkle and acne fighting, only draw back if you are prone to have sensitive skin like me, be careful how much you apply, and how often you apply it, otherwise it will really dry your skin out and your skin becomes very itchy.So make sure to follow the directions, do only apply to the effected area, stay away from anywhere from the eye area, about 1 inch at least, and try it out first and use it every other day or so.Even as I keep my Neutrogena products on hand for emergencies,:) , for the day to day use you maybe want to check out the Lush products that are also on sale here on Amazon. Dream Creme, amazing moisturizer(also for people who have dry skin due to Caner treatments !!!!) , Vanishing creme, amazing moisturizer for acne prone skin, deminishes redness, acne scars, and Herbalism, an organic cleanser.", "overall": 4.0, "summary": "Effective Product but will possibly dry out your skin", "unixReviewTime": 1325289600, "reviewTime": "12 31, 2011"}
{"reviewerID": "A14UKINVM3AI5U", "asin": "B000052YOL", "reviewerName": "q2435V34", "helpful": [0, 1], "reviewText": "I've been using the night cream from this line for a few months and quite like it -- so I decided to buy the corresponding day SPF 15 cream.Overall, it's a nice product. Moisturizes well, and have good enough SPF. I like the fact that it has retinol and comes in a tin tube (so sun can't decay the retinol). I haven't noticed any improvements in my fine lines or wrinkles, but I'm using it more as a preventative measure (I'm 34 currently).However, I have noticed that the texture of the product is a bit chalky and less nice and soothing as the night version. I attribute this to the SPF, so that's fine. I like this product enough to continue buying it.", "overall": 4.0, "summary": "Decent moisturizer, texture a bit chalky", "unixReviewTime": 1355616000, "reviewTime": "12 16, 2012"}
{"reviewerID": "A39APY9S9KLG7U", "asin": "B000052YOL", "reviewerName": "Rossella", "helpful": [0, 0], "reviewText": "yes, this product is the best I tried so far...I'm the kind of person who never really buy the same products again because I like to explore, and see other options, but this cream is it for me. lol, yes, I'm in love with it.", "overall": 5.0, "summary": "returning customer", "unixReviewTime": 1378425600, "reviewTime": "09 6, 2013"}
{"reviewerID": "A2VW61YZFDGYZV", "asin": "B000052YOL", "reviewerName": "runninghorses18", "helpful": [0, 0], "reviewText": "Face wash is very creamy and think which means you can use a lot less of it compared to thinner face washes, I do definitely feel the softness of my skin when using this, no strong smell, no residue, all in all I really like this.Eye cream is nice and smooth, I can already see a difference in the dark circles around my eyes even though this is the first use, you don't need the pearl sided amount, I just dot along my eyes and that is more then enough to get the job done.SPF 15 face cream, there is not a strong smell with any of these products which I like and so far no skin irritation even though I have never used retinol for anything before, again you do not need to pearl sized amount even though this is thick if your skin is warm it will almost melt into your skin and you wont need nearly that much. My face looks brighter and more clear and I have a lot of acne scars that are obvious.Please note I did not use the face wash that came with the eye and face cream, I used the Neutrogena anti-blemish anti-wrinkle cream I can not comment on the face wash that came with the system.Will leave another update if anything changes with these products.", "overall": 5.0, "summary": "Creamy and thick", "unixReviewTime": 1341792000, "reviewTime": "07 9, 2012"}
{"reviewerID": "AWSEZKRDIS2X1", "asin": "B000052YOL", "reviewerName": "Ruth Jett", "helpful": [0, 0], "reviewText": "with just 1 month of using this product my skin already feels so much smoother.  for people that wear makeup this is great for it soaks in very fast and doesn't just lay on top of the skin before you put your makeup on.  i have it delivered monthly and i use in the am and pm.  if it's been a very warm day i put it on again in the afternoon.  love that it has a sunscreen in it.  no such thing as using too much of this in the florida climate.  i highly recommend this.  i don't see however that it would work well for excessively dry skin.", "overall": 5.0, "summary": "great product!!!!", "unixReviewTime": 1362700800, "reviewTime": "03 8, 2013"}
{"reviewerID": "A3BOVG0TPTDRBA", "asin": "B000052YOL", "reviewerName": "sac", "helpful": [0, 1], "reviewText": "i like most of the 'healthy skin' line of products and this one was no exception.  however, i prefer lotion to a cream for daytime use, therefore, i would not likely purchase this again.", "overall": 5.0, "summary": "like the product, but prefer lotion rather than cream", "unixReviewTime": 1360713600, "reviewTime": "02 13, 2013"}
{"reviewerID": "A1YTD26YJF0E0R", "asin": "B000052YOL", "reviewerName": "santababy&lt;3", "helpful": [2, 3], "reviewText": "This is an amazing night cream. I wanted to try a mild retinol product to see how it affected my acne prone skin and I am happy to say that there are only two products in the world that do not make me break out after using it and this is one of them. I noticed my skin was much smoother after just the first application and only improved afterwards. No tingling or burning as with other retinol products and I even applied it around my eyes without any negative reactions. There wasn't any significant improvement with the fine wrinkles that I have on my forehead due to sun exposure but it is still a wonderful night cream. Overall, I definitely recommend this product.", "overall": 5.0, "summary": "Great product!!!", "unixReviewTime": 1321920000, "reviewTime": "11 22, 2011"}
{"reviewerID": "A1LH21MBCWVP7L", "asin": "B000052YOL", "reviewerName": "Shannon", "helpful": [0, 0], "reviewText": "This is the best cleanser I have used in years.  I have 30 year old skin that is starting to look a tiny bit tired after two kids and lack of sleep.  In addition I have break outs still on a regular basis or should I say I did until using this product.  Since using this product my skin is looking refreshed and I have ZERO breakouts, even around that time of the month.  I ran out and was using some sample products I had on hand and what a mistake, my blemishes came back almost instantly.  As soon as I returned to using this product my skin was clear and feeling great.  I use it once a day in combination with the Neutrogena lavender face wipes at night.  This product is not a scrub, but a creamy sort of cleanser.  I would recommend this product for sure, no hesitation.", "overall": 5.0, "summary": "Healthy Skin Cleanser", "unixReviewTime": 1392595200, "reviewTime": "02 17, 2014"}
{"reviewerID": "A2TVO3IAWCU0DU", "asin": "B000052YOL", "reviewerName": "SL", "helpful": [0, 0], "reviewText": "this is a decent face wash...nothing special for me...the consisitency however, is extremely frustrating...it is almost to thick to be separated or lathered, I don't know how to describe it lol, but it makes my skin smooth after use..i don't see any effectiveness concerning my acne problem though...probably works best on those with minor acne..", "overall": 4.0, "summary": "Good Face Wash", "unixReviewTime": 1369353600, "reviewTime": "05 24, 2013"}
{"reviewerID": "A1HBTW5M7ZZ9PT", "asin": "B000052YOL", "reviewerName": "Southern Gal 2014 \"I have sworn thee fair, th...", "helpful": [2, 2], "reviewText": "I typically use an organic night cream that costs around $30. I wanted to save on my skin products, so I bought this; I must, say it works well so far! I have VERY oily skin; the oilyness of my skin has not gone away, however, this night cream helps control it, so that when I wake up in the morning I am not too shiny! You only need half a dime size of product, so it lasts!", "overall": 4.0, "summary": "Lovely!", "unixReviewTime": 1351468800, "reviewTime": "10 29, 2012"}
{"reviewerID": "A2KQRUKXGEIPJ8", "asin": "B000052YOL", "reviewerName": "Spencer Little", "helpful": [1, 1], "reviewText": "I bought this product in despair after Neutrogena discontinued Oil-Free Acne Stress Control 3-in-1 Hydrating Acne Treatment. But I found I liked this product better. True I am older and it is time to switch to a more intense moisturizing regime, but this product really worked. I know Neutrogena has put Oil-Free Acne Stress Control 3-in-1 Hydrating Acne Treatment back on the market but I am sticking with this Anti-wrinkle stuff from now on. I highly recommend this to anyone over the age of 25 who has the intelligence to wash their face before bedtime. Use this, it may not get rid of wrinkles but it really does keep your face softer and prevents peeling and helps heal sun damage. I speak from experience. This stuff is not a miracle (most products are not) but it really does a good job and the price is very reasonable.", "overall": 5.0, "summary": "The new standard night treatment!", "unixReviewTime": 1367625600, "reviewTime": "05 4, 2013"}
{"reviewerID": "A2J0C6R7VT8YYS", "asin": "B000052YOL", "reviewerName": "Sue", "helpful": [5, 6], "reviewText": "The product information says that it may cause some irritation, and it did.  I'll try using it once or twice a week, but I need a moisturizer I can use every night, so I won't buy this again.", "overall": 1.0, "summary": "Irritating", "unixReviewTime": 1350950400, "reviewTime": "10 23, 2012"}
{"reviewerID": "A2P8OYS9QII6CN", "asin": "B000052YOL", "reviewerName": "Syd", "helpful": [1, 1], "reviewText": "Starting working after a week.  I seriously noticed a difference and I already bought a second.  Also helped with acne scars.", "overall": 5.0, "summary": "Great!", "unixReviewTime": 1359849600, "reviewTime": "02 3, 2013"}
{"reviewerID": "A3SBZ2Q5J0NN3D", "asin": "B000052YOL", "reviewerName": "Top Notch \"HRose\"", "helpful": [6, 7], "reviewText": "I love love love this! Its thick and rich without being oily. Having combo skin everything is hit or miss when it comes to face items. This is stellar and beyond what I expected. I have fine laugh lines and after only 3 days I see them smoothing out already... Just awesome!", "overall": 5.0, "summary": "Feels Amazing!", "unixReviewTime": 1334275200, "reviewTime": "04 13, 2012"}
{"reviewerID": "AMAHBN1HLBV6C", "asin": "B000052YOL", "reviewerName": "Whatshisname", "helpful": [1, 1], "reviewText": "Wasn't sure about the age of this product.  I buy this product on a regular basis and frequently the color of this cream ranges from white to a cream color.  The color on this particular product was more yellow - I wasn't sure about it but used it anyway.  It didn't seem to cause any break-out.  However, I have since purchased this from other vendors and again the color of the cream ranges from white to a cream color.", "overall": 4.0, "summary": "Cream Color was a little different", "unixReviewTime": 1387411200, "reviewTime": "12 19, 2013"}
{"reviewerID": "A3V1W3QRFU3DWF", "asin": "B000052YOL", "reviewerName": "WVUDave", "helpful": [2, 5], "reviewText": "I tried this out because of the great reviews.I didn't really notice much of a difference, but that could be because I don't have any wrinkles.I hope this will help me not get bad wrinkles as I get older...NEVER TOO EARLY TOO START!", "overall": 4.0, "summary": "Noticed Nothing, I'm 26.", "unixReviewTime": 1355270400, "reviewTime": "12 12, 2012"}
{"reviewerID": "A32E1FI2STSFV3", "asin": "B000052YOR", "reviewerName": "4Hand", "helpful": [0, 0], "reviewText": "I have used this product for several years and have not found a better shower oil.  It is cheaper to buy it at Amazon than my local drug store.", "overall": 5.0, "summary": "Love this product", "unixReviewTime": 1331251200, "reviewTime": "03 9, 2012"}
{"reviewerID": "A3UR5FRLA1LINI", "asin": "B000052YOR", "reviewerName": "abstsf", "helpful": [0, 0], "reviewText": "This bottle will last a long time. It has a pleasant scent and I typically reserve it for putting on in the evening since it does not contain sunscreen. I love to put it on before I go to bed as I really think it helps me get to sleep and I tend to think of it as a luxury product.", "overall": 5.0, "summary": "Luxury", "unixReviewTime": 1389312000, "reviewTime": "01 10, 2014"}
{"reviewerID": "A234X1MVIMPMMC", "asin": "B000052YOR", "reviewerName": "Akima Rolle \"Book Junkie\"", "helpful": [0, 0], "reviewText": "The Neutrogena Body Oil is very light. I use this when I get out of the shower and within minutes it is absorbed into my skin and my skin is hydrated through out the day. My skin does not feel oily or greasy just soft and smooth. I love that this oil is very lighly scented and does not interfere with my perfume or body spray.", "overall": 5.0, "summary": "Hydrates Your Skin Perfectly!", "unixReviewTime": 1357948800, "reviewTime": "01 12, 2013"}
{"reviewerID": "A9BLJJM9Y6R2M", "asin": "B000052YOR", "reviewerName": "Amy Lamborn", "helpful": [0, 0], "reviewText": "Highly recommend.  Will leave your skin silky smooth after a shower, with a very delicate scent.  Not greasy at all.  Highly recommend. Also real bang for the buck.", "overall": 5.0, "summary": "Delightful", "unixReviewTime": 1384560000, "reviewTime": "11 16, 2013"}
{"reviewerID": "A2V3HE239Y8PBG", "asin": "B000052YOR", "reviewerName": "anothersara", "helpful": [0, 0], "reviewText": "I'm a huge Neutrogena fan and was perusing their products on Amazon when I stumbled across this. I was about to run out of lotion and needed something that could handle how dry and flaky my shins and elbows tend to get - especially now when I'm flying a lot for work.The bottle arrived with the cap broken at the hinge unfortunately. Luckily, the oil hadn't leaked out and gotten all over, but it does make storage kind of obnoxious right now, so I'm going to have to steal a cap from an old shampoo bottle or something to replace this one.That aside, the product itself is great!  If I was choosing on fragrance alone, this wouldn't be my first pick, but the smell is very pleasant and is growing on me. Instead of rigorously toweling myself dry after my shower, I do a cursory drying, leaving my skin quite damp and then immediately use the oil. It soaks in much better and quicker that way and can proudly say my elbows haven't been ashy in over a week! I do also use this at times on my fully dry skin, and it's still great, just a little more oily feeling at first.This product is defnitely a keeper,. I just don't know how it took me so long to realize this exists!", "overall": 5.0, "summary": "How had I not found this before!", "unixReviewTime": 1393459200, "reviewTime": "02 27, 2014"}
{"reviewerID": "A3NMT0XES7THFR", "asin": "B000052YOR", "reviewerName": "Ashley", "helpful": [0, 0], "reviewText": "I never thought a body oil would be so great.  When I hear \"body oil,\" I think, \"greasy,\" \"thick,\" and \"gross.\"  Neutrogena body oil is none of those things.  I squirt a little in the tub when I run a bath, and it keeps my skin from drying out.  After I shower, I put it on my legs and they never get dry, either.  It's so light that you don't feel it at all, and the scent is very light too.  I did, however, order the unscented version for when my current bottle runs out.  My husband is hooked on this stuff too.  We keep a bottle in the shower, and when we turn the water off, we just put some on our arms and legs before we get out.  That way, we don't have to use a lot of heavy lotions instead.", "overall": 5.0, "summary": "Great everyday moisturizer, who would've thought?", "unixReviewTime": 1340236800, "reviewTime": "06 21, 2012"}
{"reviewerID": "A16FQAZE232M0R", "asin": "B000052YOR", "reviewerName": "AZ Lady", "helpful": [0, 0], "reviewText": "I've switched from body lotion to this Neutrogena Body Oil. Living in AZ is pretty dry and lotions don't rehydrate my skin after showering like this does. I've tried several methods from using it right in the shower to toweling off LIGHTLY and apply this afterward. That's the method I like the best. If I dry myself off too much and wait too long to apply the oil, I just lightly dampen my skin and then apply the oil. Great product I won't ever be without.", "overall": 5.0, "summary": "Wonder oil after showering", "unixReviewTime": 1397692800, "reviewTime": "04 17, 2014"}
{"reviewerID": "A1FCUFVPEPCWIV", "asin": "B000052YOR", "reviewerName": "barbbbb", "helpful": [0, 0], "reviewText": "I have been using this product for years and sometimes it is hard to find. I have it on subscription at Amazon and they are so good about having it to me every 2 months. I love the feel and silkiness this gives my skin and cannot imagine anything else working as good.", "overall": 5.0, "summary": "Love it", "unixReviewTime": 1373328000, "reviewTime": "07 9, 2013"}
{"reviewerID": "A112TFLXGBF6NI", "asin": "B000052YOR", "reviewerName": "Bonnie Awesome", "helpful": [0, 0], "reviewText": "As a body oil it's just fine.... I like to use a cap full in a bath. It makes my skin very soft. It will make your bathtub just disgusting though, you will have to clean it after.But the smell.... It's not my favorite to begin with, but it's ok. It's just SO strong!!!!! I give it 3 stars because it works well and does what it supposed to, but I actually don't use it. I can't handle the scent, or its strength of scent I guess.", "overall": 3.0, "summary": "Light?? Try overpowering.", "unixReviewTime": 1377216000, "reviewTime": "08 23, 2013"}
{"reviewerID": "AS12AOZ971ZF1", "asin": "B000052YOR", "reviewerName": "Demetria", "helpful": [1, 2], "reviewText": "I was intrigued by the reviews, but I actually wouldn't bother to order this again.It's too light.  It absorbs well, but I'd prefer something more effective.", "overall": 3.0, "summary": "Not All That", "unixReviewTime": 1354233600, "reviewTime": "11 30, 2012"}
{"reviewerID": "A1GB5P5A2Z7135", "asin": "B000052YOR", "reviewerName": "Dr.kari", "helpful": [6, 7], "reviewText": "This is my favorite thing on the planet! I have been using this body oil for years and years (15+ years). I use after shower before drying off, then my regular body lotion, makes my skin super soft and leaves a nice scent behind (if you like the smell that is, also comes unscented). I recommend to everyone and I know a lot of women who use it that also love this body oil. It is a little uncomfortable to get out of towels (also leave scent behind on them) but soaking in detergent for a few hours does the trick. Just leaves a silky soft finish on your skin, not on your clothes, great for dry winter skin.", "overall": 5.0, "summary": "They should have more stars!", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"}
{"reviewerID": "A350VXPRG38NFL", "asin": "B000052YOR", "reviewerName": "D. zavala \"Daniela\"", "helpful": [0, 0], "reviewText": "This oils absorbs inmediately and you can add lotion after and your skins stays hidrated all day.I think for tropical or humid climates is enough because is not heavy or too oily.", "overall": 5.0, "summary": "Not greasy", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A2KJQX0MK4E8GY", "asin": "B000052YOR", "reviewerName": "Faradeh", "helpful": [4, 4], "reviewText": "I have used this product for years. Before I get out of the shower, it turn the water on HOT.. Let it get steamy. Then turn off the water and then apply. Great on the elbows and knees . The fragrance is ok but it is a great moisturizer and not oily.", "overall": 5.0, "summary": "Love it.", "unixReviewTime": 1395360000, "reviewTime": "03 21, 2014"}
{"reviewerID": "AD9X6ZF424FK5", "asin": "B000052YOR", "reviewerName": "glowstar", "helpful": [5, 7], "reviewText": "I have very dry skin and tried this after all the great reviews.  I am sad to report that this is not as emollient or humectant as my skin needs to find comfort.  The oil feels nice and it spreads well.  It takes a while for it to absorb even though it is lightweight, but that didn't bother me.  I thought an oil would be extremely moisturizing, but my skin didn't feel or look very hydrated at all.  In fact, it felt equally as dry (as if I had applied a dry oil) with a bit of a sheen.  With a cream or lotion, the skin smoothes and plumps up with moisture.  I tried this bc I was looking for something like that but even more effective, but this doesn't work.  I may try this under a thicker lotion or cream to see if it adds anything as un under-layer.  On it's own, it is not effective.UPDATE ON PREVIOUS REVIEW: I have found that using it in the shower helps it absorb into the skin without leaving a dry oil residue behind.  However, even when I tried it with the matching lotion on top, it still did not fully hydrate my dry skin.  I'll try it again in the summer.", "overall": 2.0, "summary": "Not Moisturizing Enough to Soothe Dry Skin", "unixReviewTime": 1325030400, "reviewTime": "12 28, 2011"}
{"reviewerID": "A3GK9T2XC6Q32", "asin": "B000052YOR", "reviewerName": "Jill M. Sprecher \"jms\"", "helpful": [0, 0], "reviewText": "I love this oil, it is light and smells wonderful!!  Great for after the shower !  Will be buying again!!", "overall": 5.0, "summary": "The Best!", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"}
{"reviewerID": "APAN6NT07OFWT", "asin": "B000052YOR", "reviewerName": "June Sinclair", "helpful": [0, 0], "reviewText": "For years I have used oil on my wet skin after a shower/bath because of its moisturizing power. But when I was skin tested for allergies for new skin issues, it was discovered that I have an allergy to fragrance. That's when I switched to this product. It does what I need it to.", "overall": 5.0, "summary": "Love this stuff", "unixReviewTime": 1369267200, "reviewTime": "05 23, 2013"}
{"reviewerID": "A3EK1NEPCXMGSY", "asin": "B000052YOR", "reviewerName": "Katie", "helpful": [0, 0], "reviewText": "It's light and perfect for summer.  Much cheaper here than at Target, and it's available in the larger size, which is a better deal.", "overall": 5.0, "summary": "Love this stuff", "unixReviewTime": 1368835200, "reviewTime": "05 18, 2013"}
{"reviewerID": "A3OBI9T5SQ4GFR", "asin": "B000052YOR", "reviewerName": "KC Cowgirl \"Amazon Devotee\"", "helpful": [0, 0], "reviewText": "PRODUCT HAS PARABEN IN IT. PARABENS ARE LINKED TO OPENING THE BODY TO CANCER, PER ONCOLOGISTS. DO NOT USE ANY PRODUCTS WITH PARABENS. SHAME ON NEUTROGENA FOR USING PARABENS!", "overall": 1.0, "summary": "CANCER CAUSING PARABENS", "unixReviewTime": 1385683200, "reviewTime": "11 29, 2013"}
{"reviewerID": "A13IRKEEPFTWFM", "asin": "B000052YOR", "reviewerName": "KH1", "helpful": [0, 0], "reviewText": "Two days after I started using this product, which I love, I noticed that my skin was mush smoother and shinier than it had been before. I love the way it smells, and after using it and then going out, I've gotten complements on my perfume, even though this body oil is all that I was wearing. I put it on mysking while it's still damp, just when I get out of the shower. Highly recommended.", "overall": 5.0, "summary": "Fantastic", "unixReviewTime": 1146787200, "reviewTime": "05 5, 2006"}
{"reviewerID": "A21U4DR8M6I9QN", "asin": "B000052YOR", "reviewerName": "K. J \"justine\"", "helpful": [0, 0], "reviewText": "I started using this with my mother, chemo dried her skin out. I use it after a shower, 2-3 times a week. I like the smell of the original. thisis best for everyhting but hands, for that I use working hands, my hands take a beating. The amazon price is excellant.", "overall": 5.0, "summary": "really works for dry skin", "unixReviewTime": 1325808000, "reviewTime": "01 6, 2012"}
{"reviewerID": "A2B7JMKJJ93VQX", "asin": "B000052YOR", "reviewerName": "knittingen \"Gen\"", "helpful": [0, 1], "reviewText": "First of all, I always buy the unscented body oil because I use a dropper and squirt some of my favorite aromatherapy essential oils into it before I use it. It takes no more than one dropper full to completely scent the entire bottle of body oil. Impressive, and with heavier oils like sweet almond it takes alot more than just one dropper to carry the scent.I use this after my shower, and just a few drops on my hand can cover an entire body area (lower leg, upper leg, arm, ect). I find the moisture to be helpful, but not enough for my legs, so I use lotion there, too. But it helps, definitely. Plus it adds a sexy sheen (as in shine, not Charlie).It's also great for suntanning, though suntanning is bad for skin anyway...this at least helps keep the skin moist and isn't so heavy that it makes me feel sticky afterwards.", "overall": 5.0, "summary": "Light moisture, carries essential oil aroma very well", "unixReviewTime": 1332288000, "reviewTime": "03 21, 2012"}
{"reviewerID": "A2PSIP48R289X0", "asin": "B000052YOR", "reviewerName": "K. Towles", "helpful": [0, 0], "reviewText": "I love this product.  I put it on right after I shower and so I don't have to apply lotion after that.  It makes my skin soft, touchable and non greasy.  Unfortunately, since it is a light formula, it doesn't last for a whole day so I do have to apply lotions that evening or night if I showered in the morning.", "overall": 4.0, "summary": "Neutrogena Body Oil, Light Sesame Formula", "unixReviewTime": 1361577600, "reviewTime": "02 23, 2013"}
{"reviewerID": "AG6FUDD24E86C", "asin": "B000052YOR", "reviewerName": "LaTasha", "helpful": [0, 0], "reviewText": "This product is very gentle on the skin. I was so pleased with the fact that you only need a little and it goes a long way. I like the smell, it is not heavy and is easy to enjoy. I could see myself buying more.", "overall": 4.0, "summary": "Nice and Smooth", "unixReviewTime": 1329955200, "reviewTime": "02 23, 2012"}
{"reviewerID": "ADS99W8WMEXZ2", "asin": "B000052YOR", "reviewerName": "Michelle Dunn \"Author & artist\"", "helpful": [0, 0], "reviewText": "I have tried all kinds of oils over the years to combat dry skin.  I love this Neutrogena body oil, I love the large bottle it comes in, it has a great flip top that makes it easy to use, without making a huge oily mess.  It smells great, it goes on smoothly and is easy to blend in.  I will be ordering more of this, it works so well.  It has helped me get rid of a patch of very dry skin I had on the back of my neck.  I just put this on after a shower, when the skin is still moist.  It really moisturizes and isn't greasy.", "overall": 5.0, "summary": "Perfect for dry climates", "unixReviewTime": 1402790400, "reviewTime": "06 15, 2014"}
{"reviewerID": "A1CKC9RMTVSI0Q", "asin": "B000052YOR", "reviewerName": "NANNAN N LEE", "helpful": [0, 0], "reviewText": "I used this product to take off eye makeup regularly, it works well.  It is light and fragrance free.  I will order it again", "overall": 5.0, "summary": "good product", "unixReviewTime": 1360368000, "reviewTime": "02 9, 2013"}
{"reviewerID": "A1ODOGXEYECQQ8", "asin": "B000052YOR", "reviewerName": "Nuknuk", "helpful": [0, 0], "reviewText": "It does not smell like sesame oil at all, which is good. Not like the smell of food. It actually has a very pleasant smell.  Oil is not too thick.  Nice to apply after a bath, but you can also put some on the tub when relaxing. Wife and I are using it especially more often during the winter.  It helps you to stay a little bit warm.  Helps your skin to keep it from drying.  Not bad to use for massage, but kinda expensive for that purpose.", "overall": 5.0, "summary": "It Does Have a Very Pleasant Sensual Smell", "unixReviewTime": 1221177600, "reviewTime": "09 12, 2008"}
{"reviewerID": "A36BKFH4JT33N4", "asin": "B000052YOR", "reviewerName": "ok \"ok\"", "helpful": [0, 0], "reviewText": "Ditch the lotion for this fantastic body oil.  I use this immediately after I shower and a little goes a long way.  My skin always have a healthy glow - even during winter.  My skin is moist and NOT OILY.  This is a FANTASTIC product!!", "overall": 5.0, "summary": "I Have Glowing Moisturized Skin", "unixReviewTime": 1354492800, "reviewTime": "12 3, 2012"}
{"reviewerID": "A7MJN6MN50598", "asin": "B000052YOR", "reviewerName": "philosophotarian", "helpful": [4, 5], "reviewText": "Not an effective moisturizer (for me, anyway). It feels and smells perfectly nice. After use, my skin feels even drier and itchier than it did before I used it; it also seems to create a barrier on my skin: lotion applied after the oil (later in the day, for example) doesn't help at all. Looks like I'll be getting rid of this and going back to a shea butter-heavy lotion.", "overall": 1.0, "summary": "skin itchy and dry *after* use", "unixReviewTime": 1326931200, "reviewTime": "01 19, 2012"}
{"reviewerID": "AZ2NEHE8TNRUW", "asin": "B000052YOR", "reviewerName": "prb in California", "helpful": [0, 0], "reviewText": "Having used this fragrance free oil for years, I was saddened to find it had disappeared from my local stores.  Only the scented one is available locally, and after trying it, I vowed never to use it again.  How delighted I was to find my old favorite on Amazon.  It works best if applied to wet skin after bathing, then towel dry gently.  It is a very light oil, and is absorbed quickly. Regular use will restore dry skin to a soft, supple condition. Very highly recommended.  Thank you, Amazon! (And, of course, thank you Neutrogena, for developing the product in the first place!)", "overall": 5.0, "summary": "Best body moisturizer", "unixReviewTime": 1390435200, "reviewTime": "01 23, 2014"}
{"reviewerID": "ACYMT1PL5FO9C", "asin": "B000052YOR", "reviewerName": "Reverie", "helpful": [1, 1], "reviewText": "This goes on soooooo easily and absorbs quickly into my skin.  There is a very slight shimmer upon application.  NOT greasy at all!!!!  Since this product is fragrance-free, I've also used it in my hair, and it works as well as the Fekkai hair oil I use.  It's thin so it would be hard to overdo it like lotion.  The only thing is that when I'm in a rush, some oil droplets find their way to the floor or my counter.  Easy peasy to clean though.", "overall": 5.0, "summary": "Skin, hair = multi-purpose!", "unixReviewTime": 1351036800, "reviewTime": "10 24, 2012"}
{"reviewerID": "A3ELHHYZTD4IJ5", "asin": "B000052YOR", "reviewerName": "Satske", "helpful": [0, 0], "reviewText": "BUT NOT ANYMORE!!! This product is awesome. I put just a wee bit in my bathwater and voila!! Gets to places I was too lazy to reach. I'm not itchy from this terribly dry winter we're having and my skin doesn't feel tight. I love to also use this oil as a massage oil. There's no fragrance which I like because it allows me to put on perfume without feeling too scented.Pros:Not greasy in the bathtubHydratingSoothing for itchy dry skinSpreads easilyAbsorbs quicklyCons:Can get a little priceyMust...have....more.....", "overall": 5.0, "summary": "So I have dry itchy skin....", "unixReviewTime": 1389916800, "reviewTime": "01 17, 2014"}
{"reviewerID": "AOB3KEJZ86V3Q", "asin": "B000052YOR", "reviewerName": "S. Gremillion", "helpful": [0, 0], "reviewText": "I am trying to get rid of celluite on my legs and thighs...I know that it will take some time because it has been on my legs for many years.  I  love the way it smells and I just might have a chance to get rid of celluite.  It is easy to rub in and it does not stay oily when you rub it in really well. I do like this product.", "overall": 5.0, "summary": "Neutrogena body oil", "unixReviewTime": 1360022400, "reviewTime": "02 5, 2013"}
{"reviewerID": "A1SBVY5DX5ZKUX", "asin": "B000052YOR", "reviewerName": "S. Harrison \"Soulsista 1\"", "helpful": [0, 2], "reviewText": "Neutrogena Body Oil is an added extra....something good especially through this exceptionally brutal winter. However, for me, it doesn't work as well in the shower as I expected it to.  I love Neutrogena products and decided to try this.  It works just OK during the shower.  I even do as instructed...use on damp skin w/o rubbing off. I must say though, I find it works much better when I use it in the bath.  Maybe it's the fact that it has more time to penetrate into the skin.I have sensitive skin &amp; therefore I'm really comfortable w/Neutrogena's light products.  I may have to get something a little stronger for the shower but for my baths...it's good!", "overall": 3.0, "summary": "I Like It", "unixReviewTime": 1079481600, "reviewTime": "03 17, 2004"}
{"reviewerID": "A1XZ3Q7W0UPV56", "asin": "B000052YOR", "reviewerName": "simply_put", "helpful": [0, 0], "reviewText": "This is perfect if you have allergies to fragrance as I do.  I use this but also love the Neutrogena Rainbath.", "overall": 5.0, "summary": "Allergic to lotions?", "unixReviewTime": 1388793600, "reviewTime": "01 4, 2014"}
{"reviewerID": "A2OWR5G2OAQF7C", "asin": "B000052YOR", "reviewerName": "Sincerely Yours", "helpful": [0, 0], "reviewText": "My go to moisturizer straight after a shower.  Love it.  Light, absorbs quickly, no stickiness, and smells move too,  I have used it for years.  And it does keep your skin from drying out.  Love it.", "overall": 5.0, "summary": "Perfect alternative to Creme and lotions.,", "unixReviewTime": 1386547200, "reviewTime": "12 9, 2013"}
{"reviewerID": "A3K91X9X2ARDOK", "asin": "B000052YOR", "reviewerName": "Terrence A. \"cinemaparker@twitter\"", "helpful": [1, 1], "reviewText": "Smells nice, keeps your skin moisturized and doesn't require a lot as a small amount works very, very well. Doesn't leave residue and absorbs into your skin very quickly while still retaining moisture. As usual, Neutrogena knows their stuff and this product comes easily recommended.", "overall": 5.0, "summary": "Satisfactory results from Neutrogena, as usual!", "unixReviewTime": 1383436800, "reviewTime": "11 3, 2013"}
{"reviewerID": "A1HG6G029EQVZX", "asin": "B000052YOR", "reviewerName": "Tobey Thomas", "helpful": [0, 0], "reviewText": "I have always loved this oil.  I haven't used it in a while, so I was thrilled to get it for such a good price.  I use it on my wet skin right after a shower or bath.....it's WONDERFUL!!!  It's light and not greasy at all.  The smell is divine, but not overpowering; you can still wear your favorite perfume or body spray and it won't clash.  It's also great as a cuticle oil.", "overall": 5.0, "summary": "Have always loved this oil", "unixReviewTime": 1363564800, "reviewTime": "03 18, 2013"}
{"reviewerID": "A2GHU8I0P3HFRW", "asin": "B000052YOR", "reviewerName": "Wandrwoman \"Wise as Aphrodite, Beautiful as A...", "helpful": [7, 9], "reviewText": "I am totally devoted to this product! A 32oz pump bottle of Neutrogena Light Sesame Body Oil sits on the ledge of my bath tub right next to my other very favorite bath/shower product.....Vitabath Moisturizing Bath & Shower Gelee, Original Spring Green. When used together, my skin stays soft and smooth even during the coldest winters.I first learned of Neutrogena Light Sesame Body Oil from an article in a magazine about the personal favorite products of beauty profesionals. The oil was mentioned several times as a tried and true after-bath or shower moisturizer for even the driest or most problematic skins.The oil is meant to be applied to the body immediately after bathing or showering but before toweling dry. The oil is quickly absorbed into the skin, almost nothing is left on the towel used to dry yourself. Once dry, your skin is silky smooth but not oily. The fragrance is delicate and clean and not cloying.I then apply a good moisturizer like(Olay Quench Body Lotion Extra Dry Skin - 20.2 Oz)to my hands, feet, elbows and any other area that I think could use a little more softening and smoothing.The oil and the moisturizer combine to form a moisture barrier on the skin that lasts and lasts. It's surprising to see how quickly the oil works! And how much more effective it is to use the after-bath oil than just an moisturizer by itself.This product is a good investment in your skin's health and appearance!", "overall": 5.0, "summary": "Permanent End to Dry Skin! Really!", "unixReviewTime": 1248393600, "reviewTime": "07 24, 2009"}
{"reviewerID": "A4Q7XACX6N7XZ", "asin": "B000052YOX", "reviewerName": "AJ Eversleigh", "helpful": [3, 5], "reviewText": "I've been using this product for years and I always find myself coming back to it. Sometimes I go looking for something new but end up disappointed and upset that I ever thought to leave it (it's as close to a husband as I ever want to get).What I like about it:1. SPF is there. It's not a lot but it's there. With my other SPF makeup, I feel adequately protected.2. It absorbs quickly without taking everything with it. My skin stays soft and supple all day.3. It doesn't smell bad at all.4. IT DOESN'T BREAK ME OUT.5. My skin is extremely sensitive and with regular microdermabrasion, I am sometimes left with red, flaky skin that needs to be treated with love and care. This product doesn't exacerbate what my skin goes through and even also layers well with other moisturizers when I need backup.6. On days when I've gone without foundation and wearing only this, I've gotten complimented on how \"luminous\" my skin looks.Overall, it's an awesome product and I recommend it. As someone who also uses mostly \"high end\" products, I am amazed with how rarely Neutrogena lets me down. I thank them for saving me some serious green!", "overall": 5.0, "summary": "Old faithful", "unixReviewTime": 1348531200, "reviewTime": "09 25, 2012"}
{"reviewerID": "A3315AAN855HYG", "asin": "B000052YOX", "reviewerName": "Alice G.", "helpful": [1, 2], "reviewText": "I have to start out by saying that I am really not a fan of Neutrogena products. This is one of the exceptions. Three days after starting Accutane, I ran out of my expensive moisturizer (Physiodermie - Oily Skin Cream - 50ml) and had to run to the drugstore to buy moisturizer. I had a meltdown because they didn't have Olay in stock and bought Aveeno, Cetaphil, and this. This is the best, by a long shot. It feels nearly as good as my expensive one, but it doesn't sink into the skin quite as fast. The only downside is the smell, which is of clay. I don't mind it, since that proves it is fragrance free-- I just wish it was a little less strong.My favorite drugstore moisturizer is stillOlay Regenerist Deep Hydration Regenerating Cream, 1.7-Fluid Ounce, but I would definitely repurchase this neutrogena moisturizer!", "overall": 5.0, "summary": "An excellent drug-store moisturizer", "unixReviewTime": 1338854400, "reviewTime": "06 5, 2012"}
{"reviewerID": "A38Z2QSVGNWWKX", "asin": "B000052YOX", "reviewerName": "Amazon Customer \"Silver\"", "helpful": [0, 0], "reviewText": "Got it way before estimated time  this product is what I needed will tell  you all later how it's been doing. my face is quite red allot of the time.Update: Makes my face feel good and soft take care of the red. Good price too.", "overall": 5.0, "summary": "WOW Fast Shipping & Delivery", "unixReviewTime": 1358467200, "reviewTime": "01 18, 2013"}
{"reviewerID": "A31W8JNPO0AGYG", "asin": "B000052YOX", "reviewerName": "Amazonstudent", "helpful": [4, 6], "reviewText": "Neutrogena oil free moisture SPF 15 is amazing. The bottle has a little pump that makes it very easy to dispense. The product goes very far and you only need a little bit. This product is great for people with dry/semidry or combination skin. It helps combat dry skin in the places that need it without adding additional oil. It is also good to put under makeup. It causes much less foundation to be used up due to the fact that the skin is already moisturized. It also has SPF 15 which is great for the summer when you're not outside for long periods of time. (For long periods of sun exposure, I would suggest a higher SPF.) This product does smell a bit like sunscreen so there's no secret to what you're using!", "overall": 5.0, "summary": "A Great Addition to Your Skin Care", "unixReviewTime": 1312848000, "reviewTime": "08 9, 2011"}
{"reviewerID": "A103U3KR4L2ZXT", "asin": "B000052YOX", "reviewerName": "AndreaR \"andiemack\"", "helpful": [1, 1], "reviewText": "I have oily skin to the point where I avoided using moisturizer as every one that I tried in the past made by skin even oilier. It was embarrassing! I decided to give this one a try because of what it says it does and because I somehow developed small patches of dry skin on my face that needed to be treated, even though I was still oily. This moisturizer is absolutely amazing! My skin feels so smooth after application with no greasy after feel and I am totally shocked to see how well it has kept my makeup in place. I did not have to blot once during the day while at work. It's been 12 hours since I applied it today and my face still looks great. This product really works!!! I am overjoyed that I decided to give it a try and highly recommend it.", "overall": 5.0, "summary": "Totally Impressed!!", "unixReviewTime": 1327276800, "reviewTime": "01 23, 2012"}
{"reviewerID": "A2GAB7I4DK6E0W", "asin": "B000052YOX", "reviewerName": "Ashley Van Essen", "helpful": [0, 0], "reviewText": "I don't know what to expect of this other than a clean moisturizer. It moisturizes and doesn't leave a bad smell or oil, but it's really nothing special. I would probably look for something cheaper next time.", "overall": 3.0, "summary": "Does what it's supposed to", "unixReviewTime": 1365033600, "reviewTime": "04 4, 2013"}
{"reviewerID": "A21QPHCP3WQILU", "asin": "B000052YOX", "reviewerName": "avidreader", "helpful": [0, 0], "reviewText": "I used to use the Neutrogena moisturizer for sensitive skin, but decided to try this since my skin does tend to be oily. The lotion itself is very thin. Instead of my normal one application, with this lotion I need to apply twice, otherwise my face is dry and flaky--once after getting out of the shower, and another time before putting on my make up. The 2 stars is for the fact that my skin does look and feel good using this lotion, but there are plenty others that do just as good a job with just half the amount.", "overall": 2.0, "summary": "Meh....", "unixReviewTime": 1362268800, "reviewTime": "03 3, 2013"}
{"reviewerID": "AS4JFDB695OJG", "asin": "B000052YOX", "reviewerName": "Candis", "helpful": [0, 0], "reviewText": "another discntinued item from amazon, i love this moisterizer, need it to return though - seems like Amazon is not carrying Neutrogena products at all anymore. Very disappointing.", "overall": 5.0, "summary": "BRING IT BACK AMAZON", "unixReviewTime": 1372809600, "reviewTime": "07 3, 2013"}
{"reviewerID": "A3VT6OZGSSDSYX", "asin": "B000052YOX", "reviewerName": "Carly", "helpful": [1, 1], "reviewText": "This moisturizes my skin well without making it oily or making me break out. But it's not heavy-duty, so I recommend having a more intensive moisturizer on hand to use once a week or so to really keep your skin from getting flaky.", "overall": 4.0, "summary": "Great lightweight moisture", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
{"reviewerID": "A3AEWS3IAGNYP4", "asin": "B000052YOX", "reviewerName": "Claddagh_97", "helpful": [3, 5], "reviewText": "I purchased this facial moisturizer recently, as well as farther back a year or so. Both times I have ended up returning it, mind you I didn't purchase this on Amazon, but rather stores in-person at stores like Walmart and Target. This moisturizer says it is hypo-allergenic although I don't buy it. I am allergic to basically everything and rely on mainly baby products. I have very fair, sensitive skin and acne. I do not find this moisturizes, but rather burns one's skin horribly. After using the moisturizer, I had eroded, scabby sores all over my face. I think it made my skin much worse, although I am not supposed to be allergic to any of the ingredients. Also, for you fellow fair-skinned folks, it makes your skin look very red and ruddy in a bad way. Do not buy this, you will regret it, or at least I did.", "overall": 1.0, "summary": "Not what it says it is...", "unixReviewTime": 1391644800, "reviewTime": "02 6, 2014"}
{"reviewerID": "A140N28LQHMGRU", "asin": "B000052YOX", "reviewerName": "CSSW", "helpful": [1, 1], "reviewText": "I had meant to order the SPF version, which comes out of the pump a white color.  This is a creamy-whitish.  Nothing wrong with that, but I need the SPF coverage and I actually use it to lighten up my light tinted moisturizer...I'm kinda pale, so I will stick with the SPF next time.  That said, I still use this sometimes at night or if I know I will be bumming around the house all day with no fun-in-the-sun.  It is lightweight and, like all Neutrogena products, of high quality.", "overall": 4.0, "summary": "Good, but no SPF", "unixReviewTime": 1371168000, "reviewTime": "06 14, 2013"}
{"reviewerID": "A2K7V3G4598QRF", "asin": "B000052YOX", "reviewerName": "Daydreamer \"Keep calm and be a dreamer.\"", "helpful": [0, 0], "reviewText": "This stuff helps my skin and doesn't break me out. It is more like a lotion than a cream. I like how it has sunscreen in it to protect my face.", "overall": 5.0, "summary": "This helps my skin.", "unixReviewTime": 1374364800, "reviewTime": "07 21, 2013"}
{"reviewerID": "A1LNISCJBDOHXW", "asin": "B000052YOX", "reviewerName": "D. Wilson", "helpful": [0, 0], "reviewText": "I have used this periodically over the years and really like it.  This particular purchase was for a male friend who told me he swears by it and uses it everyday.", "overall": 5.0, "summary": "Great stuff!", "unixReviewTime": 1360800000, "reviewTime": "02 14, 2013"}
{"reviewerID": "A1FERWL29ISC3W", "asin": "B000052YOX", "reviewerName": "Gift Card \"Review Nation\"", "helpful": [2, 2], "reviewText": "I use this product daily, as well, I mix it with my thick foundation for light sheer summer coverage. I have dry sensitive skin so this product has been perfect for me. I can't recommend a better daily facial lotion, especially for the price.", "overall": 5.0, "summary": "Great product, no smell or oil build up, low price, and easy to mix with foundation for a more sheer look", "unixReviewTime": 1392595200, "reviewTime": "02 17, 2014"}
{"reviewerID": "A3CTOYWB73TMM0", "asin": "B000052YOX", "reviewerName": "happyfeet", "helpful": [0, 0], "reviewText": "I typically love Neutrogena products, so I was really disappointed in this. My biggest issues are:-It's kind of watery, yet leaves your face looking/feeling very greasy. Almost like applying sunscreen.-It has a really nasty, cloying smell (like sunscreen).-Doesn't seem to really moisturize, just sits on top of your skin. This makes it difficult to apply make up over it.I now use Clinique dramatically different lotion, and I LOVE it. I do not recommend this product.", "overall": 2.0, "summary": "Unimpressed", "unixReviewTime": 1380412800, "reviewTime": "09 29, 2013"}
{"reviewerID": "A1M9PP3OUG7P9N", "asin": "B000052YOX", "reviewerName": "henry'sapproved", "helpful": [1, 1], "reviewText": "Works really nicely.  It does not make your face oily at all but give enough moisture where it feels really nice.  I definitely recommend this product.", "overall": 5.0, "summary": "absorb very nicely", "unixReviewTime": 1321315200, "reviewTime": "11 15, 2011"}
{"reviewerID": "A2D3BBD9EQ7KVR", "asin": "B000052YOX", "reviewerName": "Icy Y.", "helpful": [1, 1], "reviewText": "Of the thousands of moisturizers that I've tried, this one has got to be the best. It goes on lightly and doesn't feel at all heavy. There is no funky scent. It does the job and it makes your skin better. I even recommend this moisturizer for peels because it really helps speed up and clean up the peeling process. Overall, a great addition to any night regimen.", "overall": 5.0, "summary": "Light and Unscented Moisturizer", "unixReviewTime": 1376265600, "reviewTime": "08 12, 2013"}
{"reviewerID": "A17QNJE95P1IVT", "asin": "B000052YOX", "reviewerName": "Jessica", "helpful": [0, 0], "reviewText": "I have 30 years old, white female. Had acne all thru my 20s, it's clearing up the older Im getting but this moisturizer has been a LIFE saver. I have tried so many other products out there, Simple, Clinique, Coconut Oil, Oil of Olay, etc... and nothing worked. They were too greasy, too smelly and caused breakouts or over drying and made my skin feel tight. Read many reviews on this, purchased this at my local Walmart and have been IN LOVE with this ever since. I use before my makeup every morning. 1 pump is plenty- apply to face, let dry (5 mins or so) and then apply makeup. I use a Neutrogena Night cream as a night moisturizer, but this would work fine too! So happy with this. No break outs, leaves my skin feeling wonderful and just enough moisture to NOT be oily! Deff reccommend this as a try! : )", "overall": 5.0, "summary": "Best Ever for DRY SKIN", "unixReviewTime": 1392076800, "reviewTime": "02 11, 2014"}
{"reviewerID": "A2SHO1S8OKKOFU", "asin": "B000052YOX", "reviewerName": "Kate", "helpful": [5, 6], "reviewText": "I have sensitive skin that seems to be becoming more and more sensitive as time goes on. I've tried lots of different products claiming to be great for sensitive skin, but those claims don't usually hold true (they either make me break out or itchy or have scents, etc. in them that are irritating....or are for more mature skin) but this stuff does! It moisturizes without being greasy or causing irritation. I've been using it for about a year now and I've never had any problems with it. Usually lotions will cause me to break out in a purple patchy rash around my mouth, but this doesn't at all. It does need a few minutes to really absorb into the skin after applying it though (at least before starting to put on make up or whatever). Definitely recommend!", "overall": 5.0, "summary": "Awesome for sensitive skin!", "unixReviewTime": 1331337600, "reviewTime": "03 10, 2012"}
{"reviewerID": "A13IRKEEPFTWFM", "asin": "B000052YOX", "reviewerName": "KH1", "helpful": [15, 17], "reviewText": "I used this product for years before switching to the Neutrogena Healthy Skin formulation, which contains glycolic acid. I loved this moisturizer. I did not find it too oily or greasy - one of the reasons that I switched to it was becuase I found it to be much lighter than the Clinique Daily Moisturizing Lotion that I had been using. I could even use this product during the summer, when it is very hot and humid where I live. Neutrogena makes great products. Highly recommended.", "overall": 5.0, "summary": "Great product", "unixReviewTime": 1146787200, "reviewTime": "05 5, 2006"}
{"reviewerID": "A3OGRDIILD96LA", "asin": "B000052YOX", "reviewerName": "kimberly", "helpful": [0, 0], "reviewText": "im 13 and i love neutrogena products. i bought this from target and it was $10. i have been using it only for a little while but i noticed it made my skin super soft!! and spf in a moisturizer is awesome, and the fact that it is no comedogenic (srry idk how to spell that??) i would totally recommed this, i have sort of oily skin and i think i just need to buy some blotting wipes or something like that, elf ahve some 150 for $3!! but i think that theres nothing that will stop the oil from coming out through the moisturizer or your makeup. if that makes sense. hope this helped :) good luck", "overall": 5.0, "summary": "super soft skin", "unixReviewTime": 1355529600, "reviewTime": "12 15, 2012"}
{"reviewerID": "AV8Z6FP0WTDG8", "asin": "B000052YOX", "reviewerName": "Lindsey Shumate", "helpful": [1, 1], "reviewText": "I have very acne prone skin and this stuff keeps the oil down and really keeps my face soft and moisturized. Love it.", "overall": 5.0, "summary": "Only moisturizer my face agrees with.", "unixReviewTime": 1369267200, "reviewTime": "05 23, 2013"}
{"reviewerID": "A2C58G8O40YC7T", "asin": "B000052YOX", "reviewerName": "MakeupAZ", "helpful": [0, 0], "reviewText": "This moisturizer was good, did not cause any acne, provides a somewhat dewy finish.  Not the best texture and perhaps alittle bit liquid like.  A decent buy.", "overall": 4.0, "summary": "Good moisturizer for Sensitive Skin", "unixReviewTime": 1313712000, "reviewTime": "08 19, 2011"}
{"reviewerID": "A1A5XWT0WI06YH", "asin": "B000052YOX", "reviewerName": "Marz", "helpful": [1, 1], "reviewText": "This is an ok moisturizing lotion, but Neutrogena has others, that are even better. Their oil-free moisture lotion seems to go on too thick (compared to other products) and gives my skin a greasy, shiny, look when worn under makeup. I use it instead as a nighttime moisturizing cr&egrave;me before bed (because of it's thick consistency and shine).There are times when my skin gets especially dry and the moisture provided here, would not be enough. I would have to keep re-applying and re-applying on my especially dry skin, sometimes many times throughout the day. (I would need a more intense moisturizing product during those times). The moisture provided from this product isn't always enough.Neutrogena has a lot of very excellent skin moisturizing products. I also use their \"Healthy Defense daily moisturizer\" with tint, to use underneath makeup and add a touch of color to the face. That one goes on a little thick too, but it's worth it to have a natural glow. And it is more of a matte finish, without the oil or shine.My favorite is the \"Neutrogena Visibly Even moisturizer\" which I am able to apply both day and night, as it goes on very smooth, thin, and light. I find it most excellent for daytime use and it even provides a nice healthy glow. The \"visibly even\"  Neutrogena product has added essential soy's and extra moisturizing ingredients to deal with even the driest of skins. It contains just the right amount of moisturizers to help my skin on the most driest of days, without being too thick and creamy, or greasy. It also covers skin blotches and dark spots as well.Before purchasing this facial moisturizer for the first time, I would take a look at some others that are out there. Do some comparasing and get the product that is right for you. There are so many out there to choose from, and Neutrogena, in particular, offers a wide array of skin products, for practically any skin type. This model is just their most basic one.", "overall": 3.0, "summary": "Just ok - Neutrogena has much better moisturizers. This one can be too oily/shiny for daytime use", "unixReviewTime": 1392336000, "reviewTime": "02 14, 2014"}
{"reviewerID": "A324GIXX5SIYGA", "asin": "B000052YOX", "reviewerName": "Pinktooth", "helpful": [0, 0], "reviewText": "I order this product for my husband. Before we got married he wouldn't bother to put anything on his face! Once he started seeing me use all my lotions and potions he asked for my recommendation. He has combination skin and since neutrogena is very hypoallegenic and I got this cream for him. He's been using it regularly for about a year now and loves  it!", "overall": 4.0, "summary": "Like it", "unixReviewTime": 1349913600, "reviewTime": "10 11, 2012"}
{"reviewerID": "A2WKJOASBR2FKM", "asin": "B000052YOX", "reviewerName": "rdelacruz21", "helpful": [1, 1], "reviewText": "I used to have more of a dry/normal skin type but as normal..skin changes over time, and for me mine has been changing to be more on the oily side and where occasional breakouts have now become a persistent thing. For a while I have already been using cleansers that target acne and didn't see much improvement. It took me a while to realize that maybe it was time I changed my moisturizer too (Duh!). My previous moisturizers were those for normal/dry and those that claim to be &#34;for all skin types&#34; (lies!!!!) so this is my first time trying a moisturizer that targets oily/combo skin.I've used this for only 2 days now but I have felt and seen instant results. I truly believe it has helped  keep the oils at bay and in turn keep my acne from continuing to swell or creating more. I was concerned that it would have more of a drying affect and leave any dry spots noticeable, but surprisingly it did not!A lot of pros:*Lightweight*Unscented*Not greasy*Not sticky*Dries almost a matte finish so you don't look shiny*While it helps to stop the oil from surfacing,  it still keeps your skin very moisturized.I'm pretty impressed with this moisturizer.  Other moisturizers tend to leave your skin sticky and shiny but this did not and it just made my skin look like bare, ungreasy, unshiny skin!! (just with pimples that are hopefully leaving soon).In case you were wondering:I use this with the Neutrogena Deep Clean Cream Cleanser and a Murad cleanser that I switch between. Also, I find that powder/mineral foundation has helped to add that extra layer of oil stopping fighting power.", "overall": 5.0, "summary": "Works for me!", "unixReviewTime": 1404432000, "reviewTime": "07 4, 2014"}
{"reviewerID": "A7T2VY28U2IDB", "asin": "B000052YOX", "reviewerName": "Samantha P.", "helpful": [1, 2], "reviewText": "I bought this for use on my face which has really bad Rosacea. It made things much worse and really did not help with moisture.", "overall": 1.0, "summary": "Lotion", "unixReviewTime": 1360022400, "reviewTime": "02 5, 2013"}
{"reviewerID": "A3HWYFFO7UYEQR", "asin": "B000052YOX", "reviewerName": "sarah", "helpful": [0, 1], "reviewText": "For years I have struggled with dry, acne-prone skin, and all moisturizers I tried caused me to break out, left my face feeling oily, or would wear-off and would need to be re-applied throughout the day. This is the first moisturizer I have tried that works for my sensitive skin without any of those problems.This product dissolves quickly without oily residue and leaves my skin feeling soft for the entire day (until I wash my face my again).  I use this product twice a day (morning and night) after I wash my face, and I love it!  If you are struggling to find a good facial moisturizer, I would definitely recommend this product!", "overall": 5.0, "summary": "Great everyday moisturizer!", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}
{"reviewerID": "ALQGOMOY1F5X9", "asin": "B000052YOX", "reviewerName": "scott", "helpful": [0, 1], "reviewText": "I am 58 years old. People tell me I look like I am in my 40's. I use this along with the very  ultra gentle cleanser. No breakouts, moisture and seems to lesson the lines to where you don't look in the mirror anymore and go ugh! How about that for this price!", "overall": 5.0, "summary": "neutrogena oil free moisture sensitive", "unixReviewTime": 1367020800, "reviewTime": "04 27, 2013"}
{"reviewerID": "A1EOB3ANCLQBSK", "asin": "B000052YOX", "reviewerName": "ScottW", "helpful": [0, 0], "reviewText": "I really like this moisturizer and use it every day as do my teenage daughters, great product that does not clog pores.", "overall": 5.0, "summary": "Neutrogena Oil-Free Moisture", "unixReviewTime": 1393545600, "reviewTime": "02 28, 2014"}
{"reviewerID": "A1HBTW5M7ZZ9PT", "asin": "B000052YOX", "reviewerName": "Southern Gal 2014 \"I have sworn thee fair, th...", "helpful": [0, 0], "reviewText": "My skin's very oily; this product controls my oil production without drying out my skin! You only need half a pump to get complete coverage! I recommend using this after washing your face with the Pomegranate face wash or the Oil-Free face wash!", "overall": 5.0, "summary": "Great for people with oily skin!", "unixReviewTime": 1351468800, "reviewTime": "10 29, 2012"}
{"reviewerID": "A2I85TDI7XF3C3", "asin": "B000052YOX", "reviewerName": "sowhat", "helpful": [0, 0], "reviewText": "I chose tiis moisturizer because it did not have SPF in it and it was advertised as not to clog the pore on my face.  I seems a little more pricey than Oil of Olay.  I have always used a moisturizer after shaving, it does a far better job of soothing the skin thanalcohol based products P.S. after about 1/2 of the bottle the pump no longer will pump and you are left with 1/2 bottle that you have to beat out with your hand to get it.... I won't make this mistake again of ordering this... Shame of them...", "overall": 5.0, "summary": "neutrogene oil free moisture sensitive skin", "unixReviewTime": 1359244800, "reviewTime": "01 27, 2013"}
{"reviewerID": "A3VU72O2BZSPXW", "asin": "B000052YOX", "reviewerName": "t4tt003d1", "helpful": [0, 0], "reviewText": "I'm 29 with combo/acne prone skin that's somewhat sensitive. I used to use Clinique Dramatically Different Moisturizing Gel, but decided to try something less expensive. The Clinique moisturizer has a more runny consistency than this moisturizer and glided on the skin more easily. This moisturizer is a little bit thicker and that makes it more moisturizing than the Clinique. I felt like the Clinique moisturizer just stayed on the skin for a few hours and than my cheeks started to feel dry and I'd feel like I needed to reapply it again. I don't have to to reapply with this one. My skin still feels moisturized hours later. This moisturizer has a lightweight feel and that's key for me because I have oily skin. I just use a very small amount and that's enough to cover my whole face and neck. It doesn't make my skin feel greasy at all. I haven't noticed any breakouts with this moisturizer either. I have an oily T-zone and my cheeks are usually dry and tend to get a little flaky. The Clinique moisturizer didn't do anything for the flakiness on my cheeks. This moisturizer absorbs into the skin perfectly and I no longer have flakiness on my cheeks. One day I washed my face and decided not to use this moisturizer to see how my face would feel. I immediately noticed the difference. This moisturizer fits my budget and my skin loves it. It's something I'll definitely repurchase.", "overall": 5.0, "summary": "Better than Clinique", "unixReviewTime": 1361059200, "reviewTime": "02 17, 2013"}
{"reviewerID": "A1VIMX0RUN1TPT", "asin": "B000052YOX", "reviewerName": "Trista Reis", "helpful": [1, 1], "reviewText": "This is the only face lotion I will use. It's not overly greasy and it has actually helped decrease my acne if I use it in the morning and before bed.", "overall": 5.0, "summary": "favorite lotion I use.", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "A1B440FN3PEW87", "asin": "B000052YOX", "reviewerName": "vgold", "helpful": [0, 0], "reviewText": "I really like it, especially for the warmer times. For reference, I have oily and acne prone skin that can be sensitive to some products.PROS:-moisturizes fairly well-dries matte (and keeps me from being shiny for about 4-5 hours if I only have this moisturizer on)-affordable-mixes well with other products (beauty oils, facial serums, sunscreen)CONS:-no SPF (personally, I find putting on sunscreen can be a laborious extra step)The only reason I didn't give this 5 stars is because I have yet to find a moisturizer like my all-time favorite one (Lancome Visionaire moisturizer). I would definitely recommend this product and would buy it again.", "overall": 4.0, "summary": "Best Drugstore Moisturizer", "unixReviewTime": 1395273600, "reviewTime": "03 20, 2014"}
{"reviewerID": "A5N1HB1T4EKCM", "asin": "B000052YP4", "reviewerName": "A. D. Hill", "helpful": [5, 7], "reviewText": "I use this both night AND morning and have never experienced a break out, rash, or any such thing. I used to use Clinique oil-free \"moisture in control\" because I would frequently break out. While I didn't break out after using it, my skin didn't feel moisturized, and after turning 40 that is key. I've been using Neutrogena Light Night Cream for over a year and love that it also contains few ingredients, no fragrance and NO sunscreen. Personally I don't like the idea of rubbing sunscreen into my face every morning, especially when I don't spend much time outside during the day. So I recommend giving this a try for both morning and night applications for sensitive skin. It makes my skin soft and moisturized but never greasy feeling. I use this in conjunction with Regenerist for sensitive skin.", "overall": 5.0, "summary": "The BEST AND Least Expensive Moisturizer on the Market", "unixReviewTime": 1207872000, "reviewTime": "04 11, 2008"}
{"reviewerID": "A2WM3V2HY2A5LU", "asin": "B000052YP4", "reviewerName": "cat49", "helpful": [0, 0], "reviewText": "This is hands down my favorite moisturizer. It's worth every cent. It feels great, lasts all day, and no more dry skin.", "overall": 5.0, "summary": "the best", "unixReviewTime": 1328659200, "reviewTime": "02 8, 2012"}
{"reviewerID": "A27TQA0XCZUXZY", "asin": "B000052YP4", "reviewerName": "Feles31", "helpful": [1, 1], "reviewText": "Light lotion, absorbs quickly, virtually no scent (no strong chemical smell.)  Excellent basic light night lotion especially if it's a hot night.  As with all neutrogena products, not a problem for my acne prone skin.", "overall": 5.0, "summary": "great basic facial lotion", "unixReviewTime": 1283385600, "reviewTime": "09 2, 2010"}
{"reviewerID": "A184HA6J5Q346X", "asin": "B000052YP4", "reviewerName": "FlowerPower1234", "helpful": [1, 2], "reviewText": "Neutrogena Light Night Cream IS in fact light, it goes on easy, you only need a little bit at a time, and guess what?  I wear it during the DAY!  It's the only thing I can ever find that isn't greasy, that goes on so smoothly and that doesn't have sunscreen in it.  I've had Melanoma before so I'm very careful about not only wearing sunscreen when I need to, but also not overdoing it and not having it on my face CONTINUALLY.  It's not good for your skin when you have chemicals all over it all the time.  So... the &#34;night&#34; cream is what I use on my face to moisturize in the morning, then if I WANT to put on sunscreen, I do.  There are weeks at a time in the winter when I don't need sunscreen because the UV index is virtually zero when it's cloudy and/or raining, so I like to have a choice about whether to have it on my face or not.  Again, too many chemicals are not good for your skin, so while sunscreen is a great invention and allows us to go outdoors without being burned from damaging ultraviolet rays, it should still be used sparingly.", "overall": 5.0, "summary": "Love This Stuff", "unixReviewTime": 1396569600, "reviewTime": "04 4, 2014"}
{"reviewerID": "A36CB8LS12L46X", "asin": "B000052YP4", "reviewerName": "Kindle Customer", "helpful": [1, 2], "reviewText": "I really wanted a very light night cream. I'm sure this mosturizes well but it left a residue that was still present the next morning. I tried it again and again, using less each time until I was putting the merest suggestion of cream on my face - no longer enough to even begin to moisturize. Reluctantly I took this off my subscription list and won't buy it again.But I do realize this is a preference thing. For some people - different age, different skin, different preferences - it might be wonderful. Certainly it seemed well blended and was fragrance free as described. For me, it came out probably one or two stars. But I'm giving it three because I think it's a nice enough product - just not for me.", "overall": 3.0, "summary": "Not so light", "unixReviewTime": 1274140800, "reviewTime": "05 18, 2010"}
{"reviewerID": "A1PHR2L45UYEP8", "asin": "B000052YP4", "reviewerName": "laroja", "helpful": [4, 6], "reviewText": "I've tried the following night creamYves Rocher Bio night creamHildegard Braukman chamomille night creamAveda night creamAnd neutrogena light cream is still the best- it is fast absorbing, light, creamy, leaves no residue, and leaves the best light scent.  The only set back is that this product contains paraben.  I hope the company improves its formulation so it no longer contains known carcinogens.", "overall": 4.0, "summary": "please improve this product!", "unixReviewTime": 1274227200, "reviewTime": "05 19, 2010"}
{"reviewerID": "ABEVVJRJ9Z1O9", "asin": "B000052YP4", "reviewerName": "LoveBios", "helpful": [0, 0], "reviewText": "This is a great night cream for sensitive skin.  It's not going to take away wrinkles or remove dark spots, but it's so inexpensive that you'll have money left over to spring for the expensive creams.", "overall": 5.0, "summary": "About the Best for the Money", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"}
{"reviewerID": "A2FEJKLHXJY7JT", "asin": "B000052YP4", "reviewerName": "Ryan Heath", "helpful": [0, 0], "reviewText": "I've used this for the past few years and it's perfect.I've tried other drug store creams that do fancy things like anti-aging or helps with sun damage, tightening, brightening, etc.  They all irritated my skin or had little effect.  This cream moisturizes and gives me a very clean glow.  I don't feel greasy, there is no stinging, tingling or itching.  It's just moisturizer doing its thing.My skin type is pretty oily too, and I live in a hot, humid area.  Despite the weather and all that, this doesn't leave my face like an oil slick in the morning and I still feel clean and moisturized.  So if you have dry skin and you want to use this, just adjust the amount of cream you use accordingly.The lack of extras in this cream may be considered a negative to some people - look at it as an opportunity to use more intense products like serums on targeted areas.  Right now I'm just using some acne spot-treatment cream and a simple eye cream for hydration, and this clean cream allows those things to do their work without having conflicting chemicals.  I like it, I'm sure other people like that too.Totally recommend this product!", "overall": 5.0, "summary": "Love this cream!", "unixReviewTime": 1373846400, "reviewTime": "07 15, 2013"}
{"reviewerID": "A3UJRNI8UR4871", "asin": "B00LLPT4HI", "reviewerName": "Wulfstan \"wulfstan\"", "helpful": [0, 1], "reviewText": "This is 100% pure Shea Butter. Do not mistake this with other &#34;Shea butter&#34; products that may contain only a little Shea but lots of other ingredients including chemicals and other stuff you might not want.This is the 'real stuff&#34;.Good news is this block will last you a long time.  Bad news is that even tho it's called &#34;butter' you can't eat it!Guys- try it for shaving, instead of shaving cream.", "overall": 5.0, "summary": "The \"Real Stuff\"!", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
